packages/backend/test/load/flag-env-key-api.yml
config:
  phases:
    - arrivalRate: 5
      duration: 6
      name: 'Warm up'
    - arrivalRate: 5
      duration: 12
      name: 'Ramp up load'
      rampTo: 50
    - arrivalRate: 50
      duration: 6
      name: 'Sustained load'
  target: 'http://localhost:4000'
scenarios:
  - name: 'Just do it'
    flow:
      - get:
          url: '/flags/sdk/valid-sdk-key'